In [2]:
import pandas as pd

# Create the DataFrames
df1 = pd.DataFrame({
    'employee_id': [101, 102, 103],
    'employee_name': ['Alice', 'Bob', 'Charlie']
})

df2 = pd.DataFrame({
    'emp_id': [101, 102, 104],
    'salary': [50000, 60000, 70000]
})

In [3]:
df1

   employee_id employee_name
0          101         Alice
1          102           Bob
2          103       Charlie

In [4]:
df2

   emp_id  salary
0     101   50000
1     102   60000
2     104   70000

In [5]:
merged_df = df1.merge(df2, left_on='employee_id', right_on='emp_id', how='inner')
print(merged_df)

   employee_id employee_name  emp_id  salary
0          101         Alice     101   50000
1          102           Bob     102   60000

In [6]:
import pandas as pd

# Create the DataFrames
df1 = pd.DataFrame({
    'employee_name': ['Alice', 'Bob', 'Charlie']
}, index=[101, 102, 103])

df2 = pd.DataFrame({
    'salary': [50000, 60000, 70000]
}, index=[101, 102, 104])

In [7]:
df1

    employee_name
101         Alice
102           Bob
103       Charlie

In [8]:
df2

     salary
101   50000
102   60000
104   70000

In [10]:
merged_df = df1.merge(df2, left_index=True, right_index=True, how='inner')
merged_df

    employee_name  salary
101         Alice   50000
102           Bob   60000

In [11]:
df3 = pd.DataFrame({
    'employee_id': [101, 102, 103],
    'employee_name': ['Alice', 'Bob', 'Charlie']
})


df3

   employee_id employee_name
0          101         Alice
1          102           Bob
2          103       Charlie

In [14]:
merged_df2 = df2.merge(df3, right_on='employee_id', left_index=True, how='inner')
print(merged_df2)

   salary  employee_id employee_name
0   50000          101         Alice
1   60000          102           Bob

In [15]:
#inner join

In [19]:
import pandas as pd

df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'],
                    'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key': ['C', 'D', 'E', 'F'],
                    'value2': [3, 4, 5, 6]})

In [20]:
df1

  key  value1
0   A       1
1   B       2
2   C       3
3   D       4

In [21]:
df2

  key  value2
0   C       3
1   D       4
2   E       5
3   F       6

In [22]:
merged_inner = df1.merge(df2, on='key', how='inner')
print(merged_inner)

  key  value1  value2
0   C       3       3
1   D       4       4

In [23]:
merged_left = df1.merge(df2, on='key', how='left')
print(merged_left)

  key  value1  value2
0   A       1     NaN
1   B       2     NaN
2   C       3     3.0
3   D       4     4.0

In [24]:
merged_right = df1.merge(df2, on='key', how='right')
print(merged_right)

  key  value1  value2
0   C     3.0       3
1   D     4.0       4
2   E     NaN       5
3   F     NaN       6

In [25]:
merged_outer = df1.merge(df2, on='key', how='outer')
print(merged_outer)

  key  value1  value2
0   A     1.0     NaN
1   B     2.0     NaN
2   C     3.0     3.0
3   D     4.0     4.0
4   E     NaN     5.0
5   F     NaN     6.0

In [26]:
df1 = pd.DataFrame({'key1': ['A', 'B', 'C', 'D'],
                    'key2': ['W', 'X', 'Y', 'Z'],
                    'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key1': ['A', 'B', 'C', 'D'],
                    'key2': ['W', 'X', 'Z', 'A'],
                    'value2': [1, 2, 3, 4]})

In [27]:
df1

  key1 key2  value1
0    A    W       1
1    B    X       2
2    C    Y       3
3    D    Z       4

In [28]:
df2

  key1 key2  value2
0    A    W       1
1    B    X       2
2    C    Z       3
3    D    A       4

In [30]:
# merge on multiple columns

In [29]:
merged_multi = df1.merge(df2, on=['key1', 'key2'], how='inner')
print(merged_multi)

  key1 key2  value1  value2
0    A    W       1       1
1    B    X       2       2

In [ ]:
df1 = pd.DataFrame({'key_left': ['A', 'B', 'C', 'D'],
                    'value1': [1, 2, 3, 4]})
df2 = pd.DataFrame({'key_right': ['C', 'D', 'E', 'F'],
                    'value2': [3, 4, 5, 6]})

merged_diff_cols = df1.merge(df2, left_on='key_left', right_on='key_right', how='inner')
print(merged_diff_cols)